In [3]:
import pandas as pd
import numpy as np
%matplotlib inline

In [4]:
df = pd.DataFrame({'A': ['foo', 'bar','foo', 'bar','foo','bar','foo','foo'],
                   'B': ['one', 'one', 'two', 'three', 'two','two','one','three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)
                  })
df

     A      B         C         D
0  foo    one -0.339787  0.833502
1  bar    one  0.630730 -0.988325
2  foo    two -0.039173  1.042184
3  bar  three  0.473749  0.127323
4  foo    two -1.334631  1.364633
5  bar    two  0.048752 -1.041257
6  foo    one -0.129692 -1.241342
7  foo  three  0.605718 -0.780305

In [10]:
df.groupby('A').sum()   # sum of group A (foo and bar)

            C         D
A
bar  1.153231 -1.902258
foo -1.237565  1.218672

In [13]:
df.groupby(['A','B']).mean()

                  C         D
A   B
bar one    0.630730 -0.988325
    three  0.473749  0.127323
    two    0.048752 -1.041257
foo one   -0.234739 -0.203920
    three  0.605718 -0.780305
    two   -0.686902  1.203408

In [16]:
df.groupby(['A','B'], as_index=False).mean()

     A      B         C         D
0  bar    one  0.630730 -0.988325
1  bar  three  0.473749  0.127323
2  bar    two  0.048752 -1.041257
3  foo    one -0.234739 -0.203920
4  foo  three  0.605718 -0.780305
5  foo    two -0.686902  1.203408

In [20]:
df.groupby('A').agg([np.sum, np.mean, np.std])   # use agg to check sum, mean, and std at the same time

            C                             D
          sum      mean       std       sum      mean       std
A
bar  1.153231  0.384410  0.301099 -1.902258 -0.634086  0.659931
foo -1.237565 -0.247513  0.702786  1.218672  0.243734  1.172163

In [21]:
df.groupby('A')['C'].agg([np.sum,np.mean,np.std])  # check sum,mean,std for C in A

          sum      mean       std
A
bar  1.153231  0.384410  0.301099
foo -1.237565 -0.247513  0.702786

In [22]:
df.groupby('A').agg({'C':np.sum, 'D': np.mean})   # check sum for C and mean for D

            C         D
A
bar  1.153231 -0.634086
foo -1.237565  0.243734

In [51]:
g =df.groupby('A')
g

In [53]:
for name,group in g:
    print(name)
    print(group)
    print()

bar
     A      B         C         D
1  bar    one  0.630730 -0.988325
3  bar  three  0.473749  0.127323
5  bar    two  0.048752 -1.041257

foo
     A      B         C         D
0  foo    one -0.339787  0.833502
2  foo    two -0.039173  1.042184
4  foo    two -1.334631  1.364633
6  foo    one -0.129692 -1.241342
7  foo  three  0.605718 -0.780305

In [29]:
g.get_group('bar')  # check the group 'bar'

     A      B         C         D
1  bar    one  0.630730 -0.988325
3  bar  three  0.473749  0.127323
5  bar    two  0.048752 -1.041257

In [33]:
g =df.groupby(['A','B'])

In [34]:
for name, group in g:
    print(name)
    print(group)
    print()

('bar', 'one')
     A    B        C         D
1  bar  one  0.63073 -0.988325

('bar', 'three')
     A      B         C         D
3  bar  three  0.473749  0.127323

('bar', 'two')
     A    B         C         D
5  bar  two  0.048752 -1.041257

('foo', 'one')
     A    B         C         D
0  foo  one -0.339787  0.833502
6  foo  one -0.129692 -1.241342

('foo', 'three')
     A      B         C         D
7  foo  three  0.605718 -0.780305

('foo', 'two')
     A    B         C         D
2  foo  two -0.039173  1.042184
4  foo  two -1.334631  1.364633

In [40]:
g.get_group(('foo', 'one'))

     A    B         C         D
0  foo  one -0.339787  0.833502
6  foo  one -0.129692 -1.241342

In [41]:
g['C']

In [43]:
for name, group in g['C']:
    print(name)
    print(group)
    print(type(group))
    print()

('bar', 'one')
1    0.63073
Name: C, dtype: float64
<class 'pandas.core.series.Series'>

('bar', 'three')
3    0.473749
Name: C, dtype: float64
<class 'pandas.core.series.Series'>

('bar', 'two')
5    0.048752
Name: C, dtype: float64
<class 'pandas.core.series.Series'>

('foo', 'one')
0   -0.339787
6   -0.129692
Name: C, dtype: float64
<class 'pandas.core.series.Series'>

('foo', 'three')
7    0.605718
Name: C, dtype: float64
<class 'pandas.core.series.Series'>

('foo', 'two')
2   -0.039173
4   -1.334631
Name: C, dtype: float64
<class 'pandas.core.series.Series'>